{
  "html": [
    {
      "title": "Какой тег используется для создания ссылки?",
      "text": "Для сознания ссылки используется тег <a>"
    },
    {
      "title": "Какой тег используется для вставки изображения?",
      "text": "Для сознания ссылки используется тег <img>"
    },
    {
      "title": "Какой тег находится в <html> определяет заголовок документа?",
      "text": "Заголовок документа определяется с помощью тега <title>"
    },
    {
      "title": "Какой атрибут используется для определения альтернативного текста изображения?",
      "text": "Для альтернативного текса изображения используется атрибут - alt"
    },
    {
      "title": "Какой атрибут позволяет открыть ссылку в новой вкладке?",
      "text": "Для открытия новой вкладки используется атрибут - target=_blank"
    },
    {
      "title": "Для чего используется атрибут 'placeholder'?",
      "text": "Атрибут 'placeholder' используется для отображения текстовой подсказки или примера ввода в поле формы до того, как пользователь начнет вводить свои данные."
    },
    {
      "title": "Как создать непронумерованный список в HTML?",
      "text": "Для создания такого списка в HTML используется тег <code>ul</code>, а для определения каждого пункта списка - тег <code>li</code>."
    },
    {
      "title": "Что такое HTML?",
      "text": "HTML (HyperText Markup Language) - это стандартизированный язык разметки, который используется для создания и разработки веб-страниц. Это система для разметки отдельных частей веб-страницы с использованием тегов, заключенных в угловые скобки."
    },
    {
      "title": "Что делает тег <!DOCTYPE>?",
      "text": "`Это декларация, которая информирует веб-браузер о версии языка разметки, использованной при создании веб-страницы. Это помогает браузеру корректно отобразить страницу."
    },
    {
      "title": "Какой тег используется для создания таблицы?",
      "text": "Для создания таблицы в html используется тег <table>"
    },
    {
      "title": "Какой тег используется для создания заголовка таблицы?",

      "text": "Для создания заголовка таблицы используется тег <thead>"
    },
    {
      "title": "Какой тег используется для создания строки таблицы?",
      "text": "Для создания строки таблицы используется тег <tr>"
    },
    {
      "title": "Какой тег используется для создания ячейки таблицы?",
      "text": "Для создания ячейки таблицы используется тег <td>"
    },
    {
      "title": "Что такое семантические теги в HTML?",
      "text": "Семантические теги в HTML - это теги, которые передают информацию о смысле или назначении содержимого, а не только о его внешнем виде. Примеры семантических тегов: header, footer, article, section, nav и др. Они помогают создавать более структурированные и доступные веб-страницы."
    },
    {
      "title": "Какой атрибут используется для установки фонового изображения?",
      "text": "Для установки фонового изображения используется атрибут - background-image"
    },
    {
      "title": "Какой тег используется для создания выпадающего списка?",
      "text": "Для создания выпадающего списка используется тег <select>"
    },
    {
      "title": "Какой тег используется для вставки JavaScript кода в HTML документ?",
      "text": "Для вставки JS кода используется тег <script>"
    },
    {
      "title": "Какой атрибут используется для указания пути к изображению?",
      "text": "Для создания пути к изображению используется атрибут - src"
    },
    {
      "title": "Что делает атрибут 'readonly' в элементе формы?",
      "text": "Атрибут 'readonly' делает элемент формы только для чтения, что значит, что пользователь не может изменять значение элемента, но может просматривать его. Это может быть полезно, если вы хотите отобразить информацию, которая не должна быть изменена."
    },
    {
      "title": "Что такое веб-стандарты и зачем они нужны?",
      "text": "Веб-стандарты - это рекомендации, разработанные группами стандартов, такими как W3C или WHATWG, для обеспечения совместимости и устойчивости веб-технологий. Они включают рекомендации по HTML, CSS, JavaScript и другим веб-технологиям. Соблюдение веб-стандартов помогает обеспечить корректную работу веб-страниц в различных браузерах и устройствах, а также облегчить обслуживание и расширение веб-сайтов в будущем."
    },
    {
      "title": "Что такое отзывчивый (responsive) веб-дизайн?",
      "text": "Это подход к веб-дизайну, который позволяет веб-страницам корректно отображаться и функционировать на различных устройствах, включая мобильные телефоны, планшеты и настольные компьютеры, путем использования гибких макетов, гибких изображений и CSS медиазапросов для адаптации дизайна к различным размерам экрана и характеристикам устройств."
    },
    {
      "title": "Какой тег HTML используется для вставки видео?",
      "text": "Для вставки видео используется тег <video>"
    },
    {
      "title": "Какой тег используется для создания главного заголовка на веб-странице?",
      "text": "Для создания главного заголовка используется тег <h1>"
    },
    {
      "title": "Что делает тег <br>?",
      "text": "Он спользуется для переноса строки, что позволяет создать новую строку в том месте, где он размещен. Это удобный способ управления расположением текста на веб-странице без использования дополнительных стилей или элементов."
    },
    {
      "title": "Какой тег используется для создания упорядоченного списка?",
      "text": "Для создания упорядоченного списка используется тег <ol>"
    },
    {
      "title": "Что такое DOM в контексте веб-разработки?",
      "text": "DOM (Document Object Model) - это программный интерфейс для веб-документов. Это представление структурированного документа в виде объектной модели, которое позволяет программам и скриптам взаимодействовать с содержимым, структурой и стилями веб-страницы. DOM представляет документ как дерево объектов, каждый из которых соответствует части страницы."
    },
    {
      "title": "Какой атрибут используется для определения стилей элемента на странице?",
      "text": "Для определение стилей используется атрибут - style"
    },
    {
      "title": "Что такое атрибут 'alt' в теге <img>?",
      "text": "Он используется для предоставления альтернативного текста, который будет отображаться в случае, если изображение не может быть загружено. Это также может быть полезно для обеспечения доступности, поскольку скрин-ридеры могут использовать этот текст для описания изображения пользователям с ограниченными возможностями."
    }
  ]
}
